app/controllers/api/v1/games_controller.rb

    def index
      @games = Game.all
---
SELECT "user_games".* FROM "user_games" WHERE "user_games"."game_id" = $1  [["game_id", 1]]