app/controllers/api/v1/profiles_controller.rb

SELECT  "profiles".* FROM "profiles" WHERE (user_id = 1) ORDER BY "profiles"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
    def show
      if @profile = Profile.find(params[:id])

INSERT INTO "profiles" ("user_id", "display_name") VALUES ($1, $2) RETURNING "id"  [["user_id", 1], ["display_name", "emoney"]]
---
    def create
      @user = get_current_user
      profile_save_params = profile_params
      profile_save_params[:user_id] = @user.id

      @profile = Profile.new(profile_save_params)
      if @profile.save

SELECT  "profiles".* FROM "profiles" WHERE (user_id = 1) ORDER BY "profiles"."id" ASC LIMIT $1  [["LIMIT", 1]]
UPDATE "profiles" SET "avatar_file_size" = $1, "avatar_updated_at" = $2, "avatar_file_name" = $3 WHERE "profiles"."id" = $4  [["avatar_file_size", 7463], ["avatar_updated_at", "2017-10-29 02:08:03.408219"], ["avatar_file_name", "data"], ["id", 1]]
---
    def update
      @profile = Profile.find(params[:id])
      if @profile.update(profile_params)