app/controllers/api/v1/user_games_controller.rb

    def my_list
      @user = get_current_user
      if @user
        favorites = UserGame.where(user_id: @user.id).map {|fav| fav.game.game_id }
---
SELECT "user_games".* FROM "user_games" WHERE "user_games"."user_id" = $1  [["user_id", 1]]

    def toggle
      @user = get_current_user
      Game.find_or_create_by(game_id: user_game_params[:game_id]) do |game|
          game.cover_url = user_game_params[:cover_url]
          game.name = user_game_params[:name]
          game.save
        end
      @game = Game.where(game_id: user_game_params[:game_id])
      @user_game = UserGame.where(game_id: @game[0].id).where(user_id: @user.id)
      if @user_game.length > 0
        @user_game[0].destroy
---
INSERT INTO "games" ("name", "game_id", "cover_url") VALUES ($1, $2, $3) RETURNING "id"  [["name", "mario"], ["game_id", 5], ["cover_url", "http"]]
SELECT  "user_games".* FROM "user_games" WHERE "user_games"."user_id" = $1 ORDER BY "user_games"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "user_games" WHERE "user_games"."id" = $1  [["id", 9]]