api/app/controllers/api/v1/profiles_controller.rb

    def show
      if @profile = Profile.where(["user_id = ?", @user.id]).first
---
SELECT  "profiles".* FROM "profiles" WHERE (user_id = 'undefined') ORDER BY "profiles"."id" ASC LIMIT $1  [["LIMIT", 1]]

    def create
      @user = get_current_user
      profile_save_params = profile_params
      profile_save_params[:user_id] = @user.id

      @profile = Profile.new(profile_save_params)
      if @profile.save
---
INSERT INTO "profiles" ("user_id", "display_name", "first_name", "last_name") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["display_name", "Killer"], ["first_name", "Franco"], ["last_name", "Eric"]]

    def update
      @profile = Profile.where(["user_id = ?", @user.id]).first
      if @profile.update(profile_params)
---
SELECT  "profiles".* FROM "profiles" WHERE (user_id = 'undefined') ORDER BY "profiles"."id" ASC LIMIT $1  [["LIMIT", 1]]
UPDATE "profiles" SET "id" = $1, "display_name" = $2, "first_name" = $3, "last_name" = $4 WHERE "profiles"."id" = $5  [["id", 1], ["display_name", "good to go"], ["first_name", "woo"], ["last_name", "hoo"], ["id", 18]]